
public class Main {
    public static void main(String args[]) {
        /* 대입 연산자 93
		대입 연산자의 왼쪽 피연산자를 lvalue(leftvalue), 오른쪽 피연산자를 rvalue(rightvalue)라고 한다.
        rvalue는 변수뿐만 아니라 식이나 상수 등이 모두 가능하다.
        lvalue는 반드시 변수처럼 값을 변경할 수 있는 것이여야 한다. 따라서 리터럴이나 상수같이 값을 저장할 수 없는 것들은 lvalue가 될 수 없다.
        
        복합대입 연산자 94
        대입연산자는 다른 연산자와 결합하여 'op='와 같은 형식으로 사용될 수 있다.
        예를들어 'i=i+3'은 'i+=3'과 같은 의미이다. (???)
        
        결합된 두 연산자는 반드시 공백없이 붙여적어야 한다.
        i +=3; 은 i=i+3; 과 같다.
        i -=3; 은 i=i-3; 과 같다.
        i *=3; 은 i=i*3; 과 같다.
        i <<=3; 은 i=i<<3; 과 같다.
        i &=3; 은 i=i&3;과 같다.
        
        i *=10+j; 은 i=i*(10+j); 과 같다.
        */

		
	}
}